{
    "TITLE": {
        "fields": [
            {"name": "TITLE", "type": "string", "default": null, "position": 0, "width": 80, "help": "Additional title line"}
        ]
    },
    "HEADING": {
        "fields": [
            {"name": "HEADING", "type": "string", "default": null, "position": 0, "width": 70, "help": "Get or set the Heading for the part"}
        ]
    },
    "ID": {
        "fields": [
            {"name": "ID", "type": "integer", "default": null, "position": 0, "width": 10, "help": "ID keyword option"}
        ]
    },
    "ID_HEADING": {
        "fields": [
            {"name": "ID", "type": "integer", "default": null, "position": 0, "width": 10, "help": "ID keyword option"},
            {"name": "HEADING", "type": "string", "default": null, "position": 10, "width": 70, "help": "Descriptor. We suggest using unique descriptions."}
        ]
    },
    "BLANK": {
        "fields": [
            {"name": "__blank1", "type": "integer", "default": null, "position": 0, "used": false, "width": 10, "help": ""},
            {"name": "__blank2", "type": "integer", "default": null, "position": 10, "used": false,"width": 10, "help": ""},
            {"name": "__blank3", "type": "integer", "default": null, "position": 20, "used": false,"width": 10, "help": ""},
            {"name": "__blank4", "type": "integer", "default": null, "position": 30, "used": false,"width": 10, "help": ""},
            {"name": "__blank5", "type": "integer", "default": null, "position": 40, "used": false,"width": 10, "help": ""},
            {"name": "__blank6", "type": "integer", "default": null, "position": 50, "used": false,"width": 10, "help": ""},
            {"name": "__blank7", "type": "integer", "default": null, "position": 60, "used": false,"width": 10, "help": ""},
            {"name": "__blank8", "type": "integer", "default": null, "position": 70, "used": false,"width": 10, "help": ""}
        ]
    },
    "CONTACT_ID": {
        "fields": [
            {"name": "CID", "type": "integer", "default": null, "position": 0, "width": 10, "help": "ID keyword option"},
            {"name": "HEADING", "type": "string", "default": null, "position": 10, "width": 70, "help": "Interface descriptor. We suggest using unique descriptions."}
        ]
    },
    "CONTACT_MPP_1": {
        "fields": [
            {"name": "IGNORE", "type": "integer", "default": 0, "position": 0, "width": 10, "help": "By setting this variable to 1, the \"ignore initial penetrations\" option is turned on for this contact.  Alternatively, this option may be turned on by setting IGNORE = 1 on Card 4 of *CONTROL_CONTACT or on Optional Card C of *CONTACT.  In other words, if IGNORE is set to 1 in any of three places, initial penetrations are tracked.  "},
            {"name": "BCKT", "type": "integer", "default": 200, "position": 10, "width": 10, "help": "Bucket sort frequency. This parameter does not apply when SOFT = 2 on Optional Card A or to Mortar contacts. For these two exceptions, the BSORT option on Optional Card A applies instead."},
            {"name": "LCBCKT", "type": "integer", "default": null, "position": 20, "width": 10, "help": "Load curve for bucket sort frequency. This parameter does not apply when SOFT = 2 on Optional Card A or to Mortar contacts.  For the two exceptions, the negative BSORT option on Optional Card A applies instead."},
            {"name": "NS2TRK", "type": "integer", "default": 3, "position": 30, "width": 10, "help": "Number of potential contacts to track for each tracked node.  The normal input for this (DEPTH on Optional Card A) is ignored.."},
            {"name": "INITITR", "type": "integer", "default": 2, "position": 40, "width": 10, "help": "Number of iterations to perform when trying to eliminate initial penetrations.  Note that an input of 0 means 0, not the default value (which is 2).  Leaving this field blank will set INITITR to 2."},
            {"name": "PARMAX", "type": "real", "default": 1.0005, "position": 50, "width": 10, "help": "The parametric extension distance for contact segments.  The MAXPAR parameter on Optional Card A is not used for MPP.  For non-tied contacts, the default is 1.0005. For tied contacts the default is 1.035 and, the actual extension used is computed as follows: see the manual"},
            {"name": "UNUSED", "type": "integer", "default": null, "position": 60, "width": 10, "used": false, "help": "not used"},
            {"name": "CPARM8", "type": "integer", "options": ["0", "1", "2", "10", "11", "12"],"default": 0, "position": 70, "width": 10, "help": "Flag for behavior of AUTOMATIC_GENERAL contacts.  CPARM8's value is interpreted as two separate flags: OPT1 and OPT2 according to the rule,\n\"CPARM8\" = \"OPT1\" + \"OPT2\".\nWhen OPT1 and OPT2 are both set, both options are active.\n\nOPT1.Flag to exclude beam - to - beam contact from the same PID.\nEQ.0:\tFlag is not set(default).\nEQ.1 : Flag is set.\nEQ.2 : Flag is set.CPARM8 = 2 additionally permits contact treatment of spot weld(type 9) beams in AUTOMATIC_GENERAL contacts; spot weld beams are otherwise disregarded entirely by AUTOMATIC_GENERAL contacts.\nOPT2.Flag to shift generated beam affecting only shell - edge - to - shell - edge treatment.See also SRNDE in Optional Card E.\nEQ.10:\tBeam generated on exterior shell edge will be shifted into the shell by half the shell thickness.Therefore, the shell - edge - to - shell - edge contact starts right at the shell edge and not at an extension of the shell edge."}
        ]
    },
    "CONTACT_MPP_2": {
        "fields": [
            {"name": "MPP2", "type": "string", "flag": true, "on": "&", "off": "",  "default": true, "position": 0, "width": 10, "help": "Flag whether this is the MPP card."},
            {"name": "CHKSEGS", "type": "integer", "default": 0, "position": 10, "width": 10, "help": "If this value is non-zero, then for the node-to-surface and surface-to-surface contacts LS-DYNA performs a special check at time 0 for elements that are inverted (or nearly so), These elements are removed from contact.  These poorly formed elements have been known to occur on the tooling in metalforming problems, which allows these problems to run.  It should not normally be needed for reasonable meshes."},
            {"name": "PENSF", "type": "real", "default": 1.0, "position": 20, "width": 10, "help": "This option is used together with IGNORE for 3D forging problems.  If non-zero, the IGNORE penetration distance is multiplied by this value each cycle, effectively pushing the tracked node back out to the surface.  This is useful for nodes that might get generated below the reference surface during 3D remeshing.  Care should be exercised, as energy may be generated and stability may be effected for values lower than 0.95.  A value in the range of 0.98 to 0.99 or higher (but < 1.0) is recommended"},
            {"name": "GRPABLE", "type": "integer", "default": 0, "position": 30, "width": 10, "help": "Set to 1 to invoke an alternate MPP communication algorithm for various SINGLE_SURFACE (including AUTOMATIC_GEN-ERAL), NODES_TO_SURFACE, SURFACE_TO_SURFACE, ERODING and SOFT = 2 contacts.  This groupable algorithm does not support all contact options, including MORTAR. It is still under development.  It can be significantly faster and scale better than the normal algorithm when there are more than two or three applicable contact types defined in the model. It is intended for speeding up the contact processing without changing the behavior of the contact.  See also *CONTROL_MPP_-CONTACT_GROUPABLE."}
        ],
        "active": "self.mpp2"
    },
    "CONTACT_CARD_1": {
        "fields": [
            {"name": "SSID", "type": "integer", "default": null, "position": 0, "width": 10, "help": "Slave segment set ID, node set ID, part set ID, part ID, or shell element set ID; see *SET_SEGMENT, *SET_NODE_OPTION, *PART, *SET_PART or *SET_SHELL_OPTION. For ERODING_SINGLE_SURFACE and ERODING_SURFACE_TO_SURFACE contact types, use either a part ID or a part set ID. For ERODING_NODES_TO_SURFACE contact, use a node set which includes all nodes that may be exposed to contact as element erosion occurs.\nEQ.0: Includes all parts in the case of single surface contact types."},
            {"name": "MSID", "type": "integer", "default": null, "position": 10, "width": 10, "help": "Master segment set ID, node set ID, part set ID, part ID, or shell element set ID.\nEQ.0: Master side is not applicable for single surface contact types."},
            {"name": "SSTYP", "type": "integer", "options": ["0", "1", "2", "3", "4", "5", "6", "7"], "default": null, "position": 20, "width": 10, "help": "ID type of SSID.\nEQ.0: Segment set ID for surface-to-surface contact.\nEQ.1: Shell element set ID for surface-to-surface contact\nEQ.2: Part set ID\nEQ.3: Part ID\nEQ.4: Node set ID for nodes-to-surface contact\nEQ.5: Include all (SSID is ignored)\nEQ.6: Part set ID for exempted parts. All non-exempted parts are included in the contact.\nEQ.7: Branch ID, see *SET_PART_TREE.\n For AUTOMATIC_BEAMS_TO_SURFACE contact, either a part set ID or a part ID can be specified."},
            {"name": "MSTYP", "type": "integer", "options": ["0", "1", "2", "3", "5", "6", "7"], "default": null, "position": 30, "width": 10, "help": "ID type of MSID.\nEQ.0: Segment set ID\nEQ.1: Shell element set ID\nEQ.2: Part set ID\nEQ.3: Part ID\nEQ.5: Include all (MSID is ignored).\nEQ.6: Part set ID for exempted parts. All non-exempted parts are included in the contact.\nEQ.7: Branch ID; see *SET_PART_TREE."},
            {"name": "SBOXID", "type": "integer", "default": null, "position": 40, "width": 10, "help": "Include in contact definition only those slave nodes/segments within box SBOXID (corresponding to BOXID in *DEFINE_BOX), or if SBOXID is negative, only those slave nodes/segments within contact volume |SBOXID| (corresponding to CVID in *DEFINE_CONTACT_VOLUME). SBOXID can be used only if SSTYP is set to 2, 3, or 6, that is, SSID is a part ID or part set ID. SBOXID is not available for ERODING contact options."},
            {"name": "MBOXID", "type": "integer", "default": null, "position": 50, "width": 10, "help": "Include in contact definition only those master segments within box MBOXID (corresponding to BOXID in *DEFINE_BOX), or if MBOXID is negative, only those master segments within contact volume |MBOXID| (corresponding to CVID in *DEFINE_CONTACT_VOLUME). MBOXID can be used only if MSTYP is set to 2, 3, or 6, that is, MSID is a part ID or part set ID. MBOXID is not available for ERODING contact options."},
            {"name": "SPR", "type": "integer", "options": ["0", "1", "2"], "default": null, "position": 60, "width": 10, "help": "Include the slave side in the *DATABASE_NCFORC and the *DATABASE_BINARY_INTFOR interface force files, and optionally in the dynain file for wear:\nEQ.0: Do not include.\nEQ.1: Slave side forces included.\nEQ.2: Same as 1 but also allows for slave nodes to be written as *INITIAL_CONTACT_WEAR to dynain; see NCYC on *INTERFACE_SPRINGBACK_LSDYNA."},
            {"name": "MPR", "type": "integer", "options": ["0", "1", "2"], "default": null, "position": 70, "width": 10, "help": "Include the master side in the *DATABASE_NCFORC and the *DATABASE_BINARY_INTFOR interface force files, and optionally in the dynain file for wear:\nEQ.0: Do not include.\nEQ.1: Master side forces included.\nEQ.2: Same as 1, but also allows for master nodes to be written as *INITIAL_CONTACT_WEAR to dynain; see NCYC on *INTERFACE_SPRINGBACK_LSDYNA."}
        ],
        "active": "self.mpp2"
    },
    "CONTACT_CARD_2" : {
        "fields": [
            {"name": "FS", "type": "real", "default": 0, "position": 0, "width": 10, "help": "Static coefficient of friction. If FS is > 0 and not equal to 2. The frictional coefficient is assumed to be dependent on the relative velocity vrel of the surfaces in contact according to, `mu = FD + (FS - FD)e^(-DC|vrel|)`. The three other possibilities are:\nEQ.2: For a subset of SURFACE_TO_SURFACE type contacts, FD is a table ID (see *DEFINE_TABLE). That table specifies two or more values of contact pressure, with each pressure value in the table corresponding to a curve of friction coefficient as a function of relative velocity. Thus, the friction coefficient becomes a function of pressure and relative velocity.\nEQ.-2: If only one friction table is defined using *DEFINE_FRICTION, it will be used and there is no need to define parameter FD. If more than one friction table is defined, then the friction table ID is defined by FD below.\nEQ.-1: If the frictional coefficients defined in the *PART section are to be used, set FS to -1.0."},
            {"name": "FD", "type": "real", "default": 0, "position": 10, "width": 10, "help": "Dynamic coefficient of friction. If FS > 0 and not equal to 2, the frictional coefficient is assumed to be dependent on the relative velocity vrel of the surfaces in contact according to, `mu = FD + (FS - FD)e^(-DC|vrel|)`. Otherwise: FS.EQ.-2: Friction table ID if more than one friction table is defined\nFS.EQ.2: Table ID for table that specifies two or more values of contact pressure, with each pressure value in the table corresponding to a curve of friction coefficient as a function of relative velocity."},
            {"name": "DC", "type": "real", "default": 0, "position": 20, "width": 10, "help": "Exponential decay coefficient. The frictional coefficient is assumed to be dependent on the relative velocity vrel of the surfaces in contact `mu = FD + (FS - FD)e^(-DC|vrel|)`."},
            {"name": "VC", "type": "real", "default": 0, "position": 30, "width": 10, "help": "Coefficient for viscous friction. This is necessary to limit the friction force to a maximum. A limiting force is computed as Flim = VC x Acont with Acont being the area of the segment contacted by the node in contact. The suggested value for VC is the yield stress in shear VC = sigma0/sqrt(3) where sigma0 is the yield stress of the contacted material."},
            {"name": "VDC", "type": "real", "default": 0, "position": 40, "width": 10, "help": "Viscous damping coefficient in percent of critical or the coefficient of restitution expressed as percentage (see ICOR on Optional Card E). In order to avoid undesirable oscillation in contact, such as for sheet forming simulation, a contact damping perpendicular to the contacting surfaces is applied. When ICOR, the 6th column of Optional Card E, is not defined or 0, the applied damping coefficient is given by zeta=(VDC/100)*zedacrit, where VDC is an integer (in units of percent) between 0 and 100. The formula for critical damping is zetacrit = 2*m*omega, where m is determined by nodal masses as `m = min(mslave, mmaster)`, and omega is determined from k, the interface stiffness, according to `omega=sqrt(k*(mslave+mmaster)/(mmaster*mslave))`."},
            {"name": "PENCHK", "type": "integer", "default": 0, "position": 50, "width": 10, "help": "Small penetration in contact search option. If the slave node penetrates more than the segment thickness times the factor XPENE (see *CONTROL_CONTACT), the penetration is ignored, and the slave node is set free. The thickness is taken as the shell thickness if the segment belongs to a shell element or it is taken as 1/20 of its shortest diagonal if the segment belongs to a solid element. This option applies to the surface-to-surface contact algorithms."},
            {"name": "BT", "type": "real", "default": 0, "position": 60, "width": 10, "help": "Birth time (contact surface becomes active at this time):\nLT.0: Birth time is set to |BT|. When negative, birth time is followed during the dynamic relaxation phase of the calculation. After dynamic relaxation has completed, contact is activated regardless of the value of BT.\nEQ.0: Birth time is inactive, meaning contact is always active\nGT.0: If DT = -9999, BT is interpreted as the curve or table ID defining multiple pairs of birth-time/death-time; see Remark 2 below. Otherwise, if DT > 0, birth time applies both during and after dynamic relaxation"},
            {"name": "DT", "type": "real", "default": 0, "position": 70, "width": 10, "help": "Death time (contact surface is deactivated at this time):\nLT.0: If DT = -9999, BT is interpreted as the curve or table ID defining multiple pairs of birth-time/death-time. Otherwise, negative DT indicates that contact is inactive during dynamic relaxation. After dynamic relaxation the birth and death times are followed and set to |BT| and |DT|, respectively\nEQ.0: DT defaults to 1020\nGT.0: DT sets the time at which the contact is deactivated."}
        ]
    },
    "CONTACT_CARD_3": {
        "fields": [
            {"name": "SFS", "type": "real", "default": 1, "position": 0, "width": 10, "help": "Scale factor on default slave penalty stiffness when SOFT = 0 or SOFT = 2; see also *CONTROL_CONTACT."},
            {"name": "SFM", "type": "real", "default": 1, "position": 10, "width": 10, "help": "Scale factor on default master penalty stiffness when SOFT = 0 or SOFT = 2; see also *CONTROL_CONTACT."},
            {"name": "SST", "type": "real", "default": null, "position": 20, "width": 10, "help": "Optional contact thickness for slave surface (overrides default contact thickness). This option applies to contact with shell and beam elements. SST has no bearing on the actual thickness of the elements; it only affects the location of the contact surface. For the *CONTACT_TIED_ options, SST and MST (below) can be defined as negative values, which will cause the determination of whether or not a node is tied to depend only on the separation distance relative to the absolute value of these thicknesses. More information is given under General Remarks: *CONTACT following Optional Card E."},
            {"name": "MST", "type": "real", "default": null, "position": 30, "width": 10, "help": "Optional contact thickness for master surface (overrides default contact thickness). This option applies only to contact with shell elements. For the TIED options, see SST above."},
            {"name": "SFST", "type": "real", "default": 1, "position": 40, "width": 10, "help": "Scale factor applied to contact thickness of slave surface. This option applies to contact with shell and beam elements. SFST has no bearing on the actual thickness of the elements; it only affects the location of the contact surface. SFST is ignored if SST is nonzero except in the case of MORTAR contact (see Remark 9 in the General Remarks: *Contact section)."},
            {"name": "SFMT", "type": "real", "default": 1, "position": 50, "width": 10, "help": "Scale factor applied to contact thickness of master surface. This option applies only to contact with shell elements. SFMT has no bearing on the actual thickness of the elements; it only affects the location of the contact surface. SFMT is ignored if MST is nonzero except in the case of MORTAR contact (see Remark 9 in the General Remarks: *Contact section)."},
            {"name": "FSF", "type": "real", "default": 1, "position": 60, "width": 10, "help": "Coulomb friction scale factor. The Coulomb friction value is scaled as `musc = FSF x muc`; see Card 2."},
            {"name": "VSF", "type": "real", "default": 1, "position": 70, "width": 10, "help": "Viscous friction scale factor. If this factor is defined, then the limiting force becomes: Flim = VSF x VC x Acont; see Card 2."}
        ]
    },
    "CONTACT_CARD_A": {
        "fields": [
            {"name": "SOFT", "type": "integer", "options": ["0", "1", "2", "4", "6"], "link": 19, "default": null, "position": 0, "width": 10, "help": "Soft constraint option:\nEQ.0: Standard penalty formulation,\nEQ.1: soft constraint penalty formulation, \nEQ.2: pinball segment based contact penalty formulation. \nEQ.4: Constraint approach for FORMING contacts. This formulation only applies to one-way forming contacts. You should use it when the penalty formulations result in large penetrations. The results, however, are sensitive to damping. \nEQ.6:Special contact algorithm to handle sheet blank edge(deformable) to gage pin(rigid shell) contact during implicit gravity loading.This applies to * CONTACT_FORMING_NODES_TO_SURFACE only.See remarks under About SOFT = 6"},
            {"name": "SOFSCL", "type": "real", "default": 0.1, "position": 10, "width": 10, "help": "Scale factor for constraint forces of soft constraint option invoked with SOFT = 1(default=.10). Values greater than .5 for single surface contact and 1.0 for a one way treatment are inadmissible."},
            {"name": "LCIDAB", "type": "integer", "default": 0, "position": 20, "width": 10, "help": "Load curve ID defining airbag thickness as a function of time for type a13 contact (*CONTACT_AIRBAG_SINGLE_SURFACE)."},
            {"name": "MAXPAR", "type": "real", "default": 1.025, "position": 30, "width": 10, "help": "Maximum parametric coordinate in segment search (values 1.025 and 1.20 recommended). Larger values can increase cost. If zero, the default is set to 1.025. This factor allows an increase in the size of the segments . May be useful at sharp corners."},
            {"name": "SBOPT", "type": "integer", "options": ["2", "0", "1", "3", "4", "5"], "default": 2, "position": 40, "width": 10, "help": "Segment-based contact options (SOFT=2).\nEQ.0: defaults to 2. \nEQ.1: pinball edge-edge contact (not recommended).\nEQ.2: assume planer segments (default).\nEQ.3: warped segment checking.\nEQ.4: sliding option,\nEQ.5: do options 3 and 4."},
            {"name": "DEPTH", "type": "integer", "default": 2, "link": -4864, "position": 50, "width": 10, "help": "Search depth in automatic contact. Value of 1 is sufficiently accurate for most crash applications and is much less expensive. LS-DYNA for improved accuracy sets this value to 2. If zero, the default is set to 2. \nLT.0: |DEPTH| is the load curve ID defining searching depth versus time."},
            {"name": "BSORT", "type": "integer", "default": null, "position": 60, "width": 10, "help": "Number of cycles between bucket sorts.  Values of 25 and 100 are recommended for contact types 4 (SINGLE_SURFACE) and 13 (AUTOMATIC_SINGLE_SURFACE), respectively.  Values of 10-15 are okay for surface-to-surface and node-to-surface contact.  If zero, LS-DYNA determines the interval.  BSORT applies only to SMP (see BCKT on MPP 1 for MPP) except in the case of SOFT = 2 or for Mortar contact, in which case BSORT applies to both SMP and MPP. For Mortar contact the default is the value associated with NSBCS on *CONTROL_CONTACT.\nLT.0: |BSORT| is the load curve ID defining bucket sorting frequency as a function of time."},
            {"name": "FRCFRQ", "type": "integer", "default": 1, "position": 70, "width": 10, "help": "Number of cycles between contact force updates for penalty contact formulations. This option can provide a significant speed-up of the contact treatment. If used, values exceeding 3 or 4 are dangerous. Considerable care must be exercised when using this option, as this option assumes that contact does not change FRCFRG cycles. \nEQ.0: FRCFRG is set to 1 and force calculations are performed each cycle-strongly recommended."}
        ]
    },
    "CONTACT_CARD_B": {
        "fields": [
            {"name": "PENMAX", "type": "real", "default": 0.0, "position": 0, "width": 10, "help": "For old types 3, 5, 8, 9, 10 (see Mapping of *CONTACT keyword option to contact type in d3hsp at the end of General Remarks) and Mortar contact, PENMAX is the maximum penetration distance. For contact types a3, a5, a10, 13, 15, and 26, the segment thickness multiplied by PENMAX defines the maximum penetration allowed (as a multiple of the segment thickness).  (See Table 0-2.):): \nEQ.0.0 for old type contacts 3, 5, and 10: Use small penetration search and value calculated from thickness and XPENE, see *CONTROL_ CONTACT. \nEQ.0.0 for contact types a 3, a 5, a10, 13, and 15: Default is 0.4, or 40 percent of the segment thickness \nEQ.0.0 for contact type26: Default is 200.0 times the segment thickness"},
            {"name": "THKOPT", "type": "integer", "options": ["0", "1", "2"], "default": 0, "position": 10, "width": 10, "help": "Thickness option for contact types 3, 5, and 10: \nEQ.0: default is taken from control card, *CONTROL_CONTACT, \nEQ.1: thickness offsets are included, \nEQ.2: thickness offsets are not included (old way)."},
            {"name": "SHLTHK", "type": "integer", "options": ["0", "1", "2"], "default": 0, "position": 20, "width": 10, "help": "Define if and only if THKOPT above equals 1. Shell thickness considered in type surface to surface and node to surface type contact options, where options 1 and 2 below activate the new contact algorithms. The thickness offsets are always included in single surface and constraint method contact types: \nEQ.0: thickness is not considered, \nEQ.1: thickness is considered but rigid bodies are excluded, \nEQ.2: thickness is considered including rigid bodies."},
            {"name": "SNLOG", "type": "integer", "options": ["0", "1"], "default": 0, "position": 30, "width": 10, "help": "Disable shooting node logic in thickness offset contact. With the shooting node logic enabled, the first cycle that a tracked node penetrates a reference segment, that node is moved back to the reference surface without applying any contact force. \nEQ.0: logic is enabled (default), \nEQ.1: logic is skipped (sometimes recommended for metalforming calculations)."},
            {"name": "ISYM", "type": "integer", "options": ["0", "1"], "default": 0, "position": 40, "width": 10, "help": "Symmetry plane option: \nEQ.0: off, \nEQ.1: do not include faces with normal boundary constraints (e.g., segments of brick elements on a symmetry plane). \nThis option is important to retain the correct boundary conditions in the model with symmetry. For the _ERODING_ contacts this option may also be defined on card 4."},
            {"name": "I2D3D", "type": "integer", "options": ["0", "1"],  "default": 0, "position": 50, "width": 10, "help": "Segment searching option: \nEQ.0: search 2D elements (shells) before 3D elements (solids, thick shells) when locating segments. \nEQ.1: search 3D (solids, thick shells) elements before 2D elements (shells) when locating segments."},
            {"name": "SLDTHK", "type": "real", "default": 0.0, "position": 60, "width": 10, "help": "Optional solid element thickness. A nonzero positive value will activate the contact thickness offsets in the contact algorithms where offsets apply. The contact treatment with then be equivalent to the case where null shell elements are used to cover the brick elements. The contact stiffness parameter below, SLDSTF, may also be used to override the default value."},
            {"name": "SLDSTF", "type": "real", "default": 0.0, "position": 70, "width": 10, "help": "Optional solid element stiffness. A nonzero positive value overrides the bulk modulus taken from the material model referenced by the solid element."}
        ]
    },
    "CONTACT_CARD_C": {
        "fields": [
            {"name": "IGAP", "type": "integer", "default": 1, "position": 0, "width": 10, "help": "For mortar contact IGAP is used to progressively increase contact stiffness for large penetrations, or use a linear relationship between penetration and contact pressure; see remarks on mortar contact below.\nFor other contacts it is a flag to improve implicit convergence behavior\nat the expense of (1) creating some sticking if parts attempt to separate\nand (2) possibly underreporting the contact force magnitude in the\noutput files rcforc and ncforc. (IMPLICIT ONLY.).\nLT.0: Like IGAP = 1 except the maximum distance between contact surfaces at which stickiness is on is sacled by IGAP/10.\nEQ.1: Apply method to improve convergence (DEFAULT)\nEQ.2: Do not apply method\nGT.2: Set IGAP = 1 for first IGAP-2 converged equilibrium states,"},
            {"name": "IGNORE", "type": "integer",  "default": 0, "position": 10, "width": 10, "help": "Ignore initial penetrations for the *CONTACT_AUTOMATIC options:LT.0:Applies only to the Mortar contact.When less than zero, the behavior is the same as for | IGNORE| , but contact between segments belonging to the same part is ignored.\nThe main purpose of this option is to avoid spurious contact detections that otherwise could result for complicated geometries in a single surface contact, typically, when eliminating initial penetrations by interference.See IGNORE = 3 and IGNORE = 4.\nEQ.0 : Take the default value from the fourth card of the* CONTROL_CONTACT input.\nEQ.1 : Allow initial penetrations to exist by tracking the initial penetrations.\nEQ.2 : Allow initial penetrations to exist by tracking the initial penetrations.However, penetration warning messages are printed with the original coordinates, and the recommended coordinates of each penetrating node are given.For Mortar contact, this is the default (see Remark 14 in the General Remarks section).\nEQ.3 : Applies only to the Mortar contact.With this option initial penetrations are eliminated between time zero and the time specified by MPAR1.Intended for small initial penetrations.See Remark 14 in the General Remarks section.\nEQ.4 : Applies only to the Mortar contact.With this option initial penetrations are eliminated between time zero and the time specified by MPAR1.In addition, a maximum penetration distance can be given as MPAR2, intended for large initial penetrations.See Remark 14 in the General Remarks section."},
            {"name": "DPRFAC", "type": "real",  "default": 0, "position": 20, "width": 10, "help": "Applies to the SOFT=2 and Mortar contacts. Depth of penetration reduction factor for SOFT=2 contact.\nEQ.0.0:Initial penetrations are always ignored.\nGT.0.0: Initial penetrations are penalized over time.\nLT.0.0:|DPRFAC| is the load curve ID defining DPRFAC versus time.\nFor the mortar conatact MPAR1 corresponds to initial contact pressure in interfaces with initial penetrations if IGNORE=2, for IGNORE=3,4 it corresponds to the time of closure of initial penetrations."},
            {"name": "DTSTIF", "type": "real", "default": 0, "position": 30, "width": 10, "help": "Applies to the SOFT=1 and SOFT=2 and Mortar contacts. Time step used in stiffness calculation for SOFT=1 and SOFT=2 contact.\nEQ.0.0:Use the initial value that is used for time integration.\nGT.0.0: Use the value specified.\nLT.-0.01 and GT.-1.0: use a moving average of the solution time step. (SOFT=2 only).\nLT.-1.0: |DTSTIF| is the load curve ID defining DTSTIF versus time.\nFor the mortar contact and IGNORE=4, MPAR2 corresponds a penetration depth that must be at least the penetration occurring in the contact interface."},
            {"name": "EDGEK", "type": "real", "default": 0, "position": 40, "width": 10, "help": "Scale factor for penalty stiffness of edge to edge contact when SOFT = 2 and DEPTH = 5, 15, 25, or 35:\nEQ.0.0: Use the default penalty stiffness.\nGT.0.0: Scale the stiffness by EDGEK."},
            {"name": "FLANGL", "type": "real", "default": 0.0, "position": 60, "width": 10, "help": "Angle tolerance in radians for feature lines option in smooth contact.\nEQ.0.0:No feature line is considered for surface fitting in smooth contact.\nGT.0.0:Any edge with angle between two contact segments bigger than this angle will be treated as feature line during surface fitting in smooth contact."},
            {"name": "CID_RCF", "type": "integer", "default": null, "position": 70, "width": 10, "help": "Coordinate system ID to output RCFORC force resultants in a local system."}
        ]
    },
    "CONTACT_CARD_C_R": {
        "fields": [
            {"name": "IGAP", "type": "integer", "default": 1, "position": 0, "width": 10, "help": "For mortar contact IGAP is used to progressively increase contact\nstiffness for large penetrations, see remarks on mortar contact below.\nFor other contacts it is a flag to improve implicit convergence behavior\nat the expense of (1) creating some sticking if parts attempt to separate\nand (2) possibly underreporting the contact force magnitude in the\noutput files rcforc and ncforc. (IMPLICIT ONLY.).\nLT.0: Set IGAP = 1 and set the distance for turning on the stiffness to (IGAP/10) times the original distance.\nEQ.1: Apply method to improve convergence (DEFAULT)\nEQ.2: Do not apply method\nGT.2: Set IGAP = 1 for first IGAP-2 converged equilibrium states,"},
            {"name": "IGNORE", "type": "integer", "options": ["0", "1", "2", "3", "4", "-1", "-2", "-3", "-4"], "default": 0, "position": 10, "width": 10, "help": "Ignore initial penetrations in the *CONTACT_AUTOMATIC options. This option can also be specified for each interface. The value defined here will be the default. \nEQ.0: Take the default value from the fourth card of the CONTROL_ CONTACT input. \nEQ.1: Allow initial penetrations to exist by tracking the initial penetrations. \nEQ.2: allow initial penetration in the model definition.\nEQ.3: Applies only to the Mortar contact. With this option initial penetrations are eliminated between time zero and the time specified by MPAR1. Intended for small initial penetrations. See remarks on Mortar contact.\nEQ.4: Applies only to the Mortar contact. With this option initial penetrations are eliminated between time zero and the time specified by MPAR1. In addition a maximum penetration distance can be given as MPAR2, intended for large initial penetrations. See remarks on Mortar contact.\nLT.0: Applies only to the Mortar contact. This meaning of this is the same as for |IGNORE|, but contact between segments that belong to the same part is ignored. The main purpose with this option is to avoid spurious contact detections that otherwise could result for complicated geometries in a single surface contact, typically when eliminating initial penetrations by interference. See IGNORE.EQ.3 and IGNORE.EQ.4."},
            {"name": "DPRFAC", "type": "real",  "default": 0, "position": 20, "width": 10, "help": "Applies to the SOFT=2 and Mortar contacts. Depth of penetration reduction factor for SOFT=2 contact.\nEQ.0.0:Initial penetrations are always ignored.\nGT.0.0: Initial penetrations are penalized over time.\nLT.0.0:|DPRFAC| is the load curve ID defining DPRFAC versus time.\nFor the mortar conatact MPAR1 corresponds to initial contact pressure in interfaces with initial penetrations if IGNORE=2, for IGNORE=3,4 it corresponds to the time of closure of initial penetrations."},
            {"name": "DTSTIF", "type": "real", "default": 0, "position": 30, "width": 10, "help": "Applies to the SOFT=1 and SOFT=2 and Mortar contacts. Time step used in stiffness calculation for SOFT=1 and SOFT=2 contact.\nEQ.0.0:Use the initial value that is used for time integration.\nGT.0.0: Use the value specified.\nLT.-0.01 and GT.-1.0: use a moving average of the solution time step. (SOFT=2 only).\nLT.-1.0: |DTSTIF| is the load curve ID defining DTSTIF versus time.\nFor the mortar contact and IGNORE=4, MPAR2 corresponds a penetration depth that must be at least the penetration occurring in the contact interface."},
            {"name": "FLANGL", "type": "real",  "default": 0.0, "position": 60, "width": 10, "help": "Angle tolerance in radians for feature lines option in smooth contact.\nEQ.0.0:No feature line is considered for surface fitting in smooth contact.\nGT.0.0:Any edge with angle between two contact segments bigger than this angle will be treated as feature line during surface fitting in smooth contact."},
            {"name": "CID_RCF", "type": "integer",  "default": null, "position": 70, "width": 10, "help": "Coordinate system ID to output RCFORC force resultants in a local system."}
        ]
    },
    "CONTACT_CARD_D": {
        "fields": [
            {"name": "Q2TRI", "type": "integer", "options": ["0", "1", "2", "3", "4"], "default": 0, "position": 0, "width": 10, "help": "Option to split quadrilateral contact segments into two triangles (only available when SOFT=2).\nEQ.0:Off (default).\nEQ.1:On for all SURFA shell segments.\nEQ.2:On for all SURFB shell segments.\nEQ.3:On for all shell segments.\nEQ.4:On for all shell segments of material type 34."},
            {"name": "DTPCHK", "type": "real", "default": 0, "position": 10, "width": 10, "help": "Time interval between shell penetration reports (only available for segment based contact)\nEQ.0.0:Off (default).\nGT.0.0:  Check and report segment penetrations at time intervals equal to DTPCHK.\nLT.0.0:Check and report segment penetrations at time intervals equal to |DTPCHK|. In addition, calculation stops with an error at t=0 if any intersections are initially present"},
            {"name": "SFNBR", "type": "real", "default": 0, "position": 20, "width": 10, "help": "Scale factor for neighbor segment contact (only available for segment based contact)\nEQ.0.0:Off (default).\nGT.0.0:  Check neighbor segments for contact"},
            {"name": "FNLSCL", "type": "real", "default": 0, "position": 30, "width": 10, "help": "Scale factor for nonlinear force scaling"},
            {"name": "DNLSCL", "type": "real", "default": 0, "position": 40, "width": 10, "help": "Distance for nonlinear force scaling"},
            {"name": "TCSO", "type": "integer", "options": ["0", "1"], "default": 0, "position": 50, "width": 10, "help": "Option to consider only contact segments (not all attached elements) when\ncomputing the contact thickness for a node or segment (for SURFACE_TO_SURFACE contact and shell elements only)\nEQ.0: Off (default).\nEQ.1: Only consider segments in the contact definition"},
            {"name": "TIEDID", "type": "integer", "options": ["0", "1"], "default": 0, "position": 60, "width": 10, "help": "Incremental displacement update for tied contacts.EQ.0:  Off (default).\nEQ.1:  On."},
            {"name": "SHLEDG", "type": "integer", "options": ["0", "1", "2"], "default": 0, "position": 70, "width": 10, "help": "Flag for assuming edge shape for shells when measuring penetration.This is available for segment - based contact(SOFT = 2).\nEQ.0:Default to SHELDG on * CONTROL_CONTACT\nEQ.1 : Shell edges are assumed to be square and are flush with the nodes.\nEQ.2 : Shell edges are assumed to be round with a radius equal to half the shell thickness.The edge centers lie on the lines between the segment nodes and extend outward by the radius.This option is not available for DEPTH values of 23, 33, or 35."}
        ]
    },
    "CONTACT_CARD_E": {
        "fields": [
            {"name": "SHAREC", "type": "integer", "options": ["0", "1"], "default": 0, "position": 0, "width": 10, "help": "Shared constraint flag (only available for segment based contact)\nEQ.0: Segments that share constraints not checked for contact.\nEQ.1: Segments that share constraints are checked for contact."},
            {"name": "CPARM8", "type": "integer", "options": ["0", "2"], "default": 0, "position": 10, "width": 10, "help": "This variable is similar to CPARM8 in *CONTACT_..._MPP but applies to SMP and not to MPP.  CPARM8 for SMP only controls treatment of spot weld beams in *CONTACT_AUTOMATIC_GENERAL. \nEQ.0:Spot weld(type 9) beams are not considered in the contact even if included in SURFA\nEQ.2:Spot weld(type 9) beams are considered in the contact if included in SURFA"},
            {"name": "IPBACK", "type": "integer", "default": 0, "position": 20, "width": 10, "help": "If set to a nonzero value, creates a  backup  penalty tied contact for this\ninterface. This option applies to constrained tied contacts only. See Remark 2."},
            {"name": "SRNDE", "type": "integer", "default": 0, "position": 30, "width": 10, "help": "Segment Rounded Edges:\nEQ.0: free edges have their usual treatement\nEQ.1: free edges are rounded, but without extending them."},
            {"name": "FRICSF", "type": "real", "default": 1.0, "position": 40, "width": 10, "help": "Scale factor for frictional stiffness (available for SOFT = 2 only)."},
            {"name": "ICOR", "type": "integer", "default": 0, "position": 50, "width": 10, "help": "If set to a nonzero value, VDC is the coefficient of restitution\nexpressed as a percentage. When SOFT = 0 or 1, this option applies\nto AUTOMATIC_NODES_TO_SURFACE, AUTOMATIC_SURFACE_TO_SURFACE and AUTOMATIC_SINGLE_SURFACE.\nWhen SOFT = 2, it applies to all available keywords."},
            {"name": "FTORQ", "type": "integer", "default": 0, "position": 60, "width": 10, "help": "If set to 1, a torsional force is computed in the beam to beam portion\nof contact type AUTOMATIC_GENERAL, which balances the\ntorque produced due to friction. This is currently only available in the MPP version."},
            {"name": "REGION", "type": "integer", "link": 108, "default": 0, "position": 70, "width": 10, "help": "The ID of a *DEFINE_REGION which will delimit the volume of\nspace where this contact is active. See Remark 4 below."}
        ]
    },
    "CONTACT_CARD_F": {
        "fields": [
            {"name": "PSTIFF", "type": "integer", "options": ["0", "1", "2"], "default": 0, "position": 0, "width": 10, "help": "Flag to choose the method for calculating the penalty stiffness. This is available for segment based contact (see SOFT on optional card A)\nEQ.0: Use the default as defined by PSTIFF on *CONTROL_CONTACT.\nEQ.1: Based on nodal masses\nEQ.2: Based on material density and segment dimensions."},
            {"name": "IGNROFF", "type": "integer", "options": ["0", "1", "2", "3"], "default": 0, "position": 10, "width": 10, "help": "Flag to ignore the thickness offset for shells in the calculation of the shell contact penetration depth. This allows shells to be used for\nmeshing rigid body dies without modifying the positions of the nodes to compensate for the shell thickness.\nEQ.0: Default\nEQ.1: Ignore the SURFB side thickness.\nEQ.2: Ignore the SURFA side thickness.\nEQ.3: Ignore the thickness of both sides.."},
            {"name": "FSTOL", "type": "real", "default": 2.0, "position": 30, "width": 10, "help": "Tolerance used with the SMOOTH option for determining which segments are considered flat.  The value is in degrees and approximately represents half the angle between adjacent segments"},
            {"name": "2DBINR", "type": "integer", "options": ["0", "1"], "default": 0, "position": 40, "width": 10, "help": "Flag to indicate that 2D belts initially inside retractors are involved in the contact.  This is only available for SURFACE_TO_SURFACE contact of segment-based contact (SOFT = 2).\nEQ.0:No 2D belt initially inside a retractor is involved.\nEQ.1 : 2D belts initially inside retractors are involved"},
            {"name": "SSFTYP", "type": "integer", "options": ["0", "1"], "default": 0, "position": 50, "width": 10, "help": "Flag to determine how the SSF option on *PART_CONTACT behaves when SOFT = 2 on optional card A:\nEQ.0:Use SSF from the tracked segment as determined by the SOFT = 2 algorithm (see Remark 2) \nEQ.1 : Use the larger of the SSF values."},
            {"name": "SWTPR", "type": "integer", "options": ["0", "1"], "default": 0, "position": 60, "width": 10, "help": "Flag to use tapered shell contact segments adjacent to segments that are thinned by the SPOTHIN option on *CONTROL_CONTACT. This option is only available when SOFT=2 on optional card A.\nEQ.0:Use full thickness constant segments.\nEQ.1 : Use tapered segments."},
            {"name": "TETFAC", "type": "real", "default": 0.0, "position": 70, "width": 10, "help": "Scale factor for the computed volume of tetrahedral solid elements for the mass calculation in SOFT=2 contact. By default, half the mass of a solid element is considered for the contact segment, which is reasonable for hexahedrons. In contrast, for tetrahedrons, a larger value than 0.5 would be preferrable, because several tets fit into one hex. Therefore, a TETFAC value around 3.0 to 5.0 should make the contact stiffness more comparable with hex meshes."}
        ]
    },
    "CONTACT_CARD_G": {
        "fields": [
            {"name": "SHLOFF", "type": "real", "default": 0.0, "position": 10, "width": 10, "help": "Flag affecting the location of the contact surfaces for shells when NLOC is nonzero in *SECTION_SHELL or *PART_COMPOSITE, or when OFFSET is specified using *ELEMENT_SHELL_OFFSET. Thus, set this field to 1 to enable the behavior locally for this contact and leave CNTCO as 0 to disable this behavior for all contacts without this field set to 1.\nEQ.0: The setting of CNTO on *CONTROL_SHELL determines the contact reference plane.\nEQ.1:The contact reference plance coincides with shell reference surface."}
        ]
    },
    "INITIAL_STRAIN_SHELL_LARGE": {
        "fields": [
            {"name": "EPSXX", "type": "real", "default": "0.0", "position": 0, "width": 20, "help": "Define the xx strain component at inner integration (global cartesian system)."},
            {"name": "EPSYY", "type": "real", "default": "0.0", "position": 20, "width": 20, "help": "Define the yy strain component at inner integration (global cartesian system)."},
            {"name": "EPSZZ", "type": "real", "default": "0.0", "position": 40, "width": 20, "help": "Define the zz strain component at inner integration (global cartesian system)."},
            {"name": "EPSXY", "type": "real", "default": "0.0", "position": 60, "width": 20, "help": "Define the xy strain component at inner integration (global cartesian system)."},
            {"name": "EPSYZ", "type": "real", "default": "0.0", "position": 80, "width": 20, "help": "Define the yz strain component at inner integration (global cartesian system)."}
        ]
    },
    "INITIAL_STRAIN_SHELL_LARGE_CARD2": {
        "fields": [
            {"name": "EPSZX", "type": "real", "default": "0.0", "position": 0, "width": 20, "help": "Define the zx strain component at inner integration (global cartesian system)."},
            {"name": "T", "type": "real", "default": "0.0", "position": 20, "width": 20, "help": "Parametric coordinate of through thickness integration point between -1and 1 inclusive."}
        ]
    },
    "INITIAL_STRESS_SHELL_LARGE_CARD1": {
        "fields": [
            {"name": "T", "type": "real", "default": null, "position": 0, "width": 20, "help": "Parametric coordinate of through thickness integration point. Between -1 and 1 inclusive."},
            {"name": "SIGXX", "type": "real", "default": "0.0", "position": 20, "width": 20, "help": "Define the xx stress component (global cartesian system)."},
            {"name": "SIGYY", "type": "real", "default": "0.0", "position": 40, "width": 20, "help": "Define the yy stress component (global cartesian system)."},
            {"name": "SIGZZ", "type": "real", "default": "0.0", "position": 60, "width": 20, "help": "Define the zz stress component (global cartesian system)."},
            {"name": "SIGXY", "type": "real", "default": "0.0", "position": 80, "width": 20, "help": "Define the xy stress component (global cartesian system)."}
        ]
    },
    "INITIAL_STRESS_SHELL_LARGE_CARD2": {
        "fields": [
            {"name": "SIGYZ", "type": "real", "default": "0.0", "position": 0, "width": 20, "help": "Define the yz stress component (global cartesian system)."},
            {"name": "SIGZX", "type": "real", "default": "0.0", "position": 20, "width": 20, "help": "Define the zx stress component (global cartesian system)."},
            {"name": "EPS", "type": "real", "default": "0.0", "position": 40, "width": 20, "help": "Effective plastic strain."}
        ]
    },
    "INITIAL_STRESS_SHELL_LARGE_HISV": {
        "fields": [
            {"name": "HISV1", "type": "real", "default": null, "position": 0, "width": 20, "help": "Define the nth history variable. The stresses are defined in the GLOBAL cartesian system"},
            {"name": "HISV2", "type": "real", "default": null, "position": 20, "width": 20, "help": "Define the nth history variable. The stresses are defined in the GLOBAL cartesian system"},
            {"name": "HISV3", "type": "real", "default": null, "position": 40, "width": 20, "help": "Define the nth history variable. The stresses are defined in the GLOBAL cartesian system"},
            {"name": "HISV4", "type": "real", "default": null, "position": 60, "width": 20, "help": "Define the nth history variable. The stresses are defined in the GLOBAL cartesian system"},
            {"name": "HISV5", "type": "real", "default": null, "position": 80, "width": 20, "help": "Define the nth history variable. The stresses are defined in the GLOBAL cartesian system"}
        ]
    }
}
